witalis3/UA3REO-DDC-Transceiver/STM32/WOLF/Src/front_unit.c
#include "front_unit.h"
#include "agc.h"
#include "audio_filters.h"
#include "auto_notch.h"
#include "functions.h"
#include "lcd.h"
#include "main.h"
#include "noise_reduction.h"
#include "rf_unit.h"
#include "sd.h"
#include "settings.h"
#include "stm32h7xx_hal.h"
#include "system_menu.h"
#include "trx_manager.h"
#include "vad.h"

int8_t FRONTPANEL_ProcessEncoder1 = 0;
int8_t FRONTPANEL_ProcessEncoder2 = 0;

#ifdef HRDW_MCP3008_1
bool FRONTPanel_MCP3008_1_Enabled = true;
#endif
#ifdef HRDW_MCP3008_2
bool FRONTPanel_MCP3008_2_Enabled = true;
#endif
#ifdef HRDW_MCP3008_3
bool FRONTPanel_MCP3008_3_Enabled = true;
#endif

static void FRONTPANEL_ENCODER_Rotated(float32_t direction);
static void FRONTPANEL_ENCODER2_Rotated(int8_t direction);
static void FRONTPANEL_ENCODER2_Rotated(int8_t direction);
static void FRONTPANEL_ENC2SW_click_handler(uint32_t parameter);
static void FRONTPANEL_ENC2SW_hold_handler(uint32_t parameter);
static uint16_t FRONTPANEL_ReadMCP3008_Value(uint8_t channel, uint8_t adc_num, uint8_t count);

static int32_t ENCODER_slowler = 0;
static uint32_t ENCODER_AValDeb = 0;
static uint32_t ENCODER2_AValDeb = 0;

#ifdef FRONTPANEL_SMALL_V1
PERIPH_FrontPanel_Button PERIPH_FrontPanel_Buttons[] = {
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_PRE,
     .holdHandler = BUTTONHANDLER_PGA}, // PRE-PGA
    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_ATT,
     .holdHandler = BUTTONHANDLER_ATTHOLD}, // ATT-ATTHOLD
    {.port = 1,
     .channel = 5,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_MUTE,
     .holdHandler = BUTTONHANDLER_SCAN}, // MUTE-SCAN
    {.port = 1,
     .channel = 4,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_AGC,
     .holdHandler = BUTTONHANDLER_AGC_SPEED}, // AGC-AGCSPEED
    {.port = 1,
     .channel = 3,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_ArB,
     .holdHandler = BUTTONHANDLER_ANT}, // A=B-ANT
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_TUNE,
     .holdHandler = BUTTONHANDLER_TUNE}, // TUNE
    {.port = 1,
     .channel = 1,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_RF_POWER,
     .holdHandler = BUTTONHANDLER_SQUELCH}, // RFPOWER-SQUELCH
    {.port = 1,
     .channel = 0,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_BW,
     .holdHandler = BUTTONHANDLER_HPF}, // BW-HPF

    {.port = 2, .channel = 7, .type = FUNIT_CTRL_IF_RIT_XIT}, // RIT/XIT
    {.port = 2, .channel = 6, .type = FUNIT_CTRL_AF_GAIN},    // AF GAIN
    {.port = 2,
     .channel = 5,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_DNR,
     .holdHandler = BUTTONHANDLER_NB}, // DNR-NB
    {.port = 2,
     .channel = 4,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_NOTCH,
     .holdHandler = BUTTONHANDLER_SNAP_LEFT}, // NOTCH-SNAP_LEFT
    {.port = 2,
     .channel = 3,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_SPLIT,
     .holdHandler = BUTTONHANDLER_RIT}, // SPLIT-RIT
    {.port = 2,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_CQ,
     .holdHandler = BUTTONHANDLER_REC}, // REC-CQ
    {.port = 2,
     .channel = 1,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_SERVICES,
     .holdHandler = BUTTONHANDLER_SNAP_RIGHT}, // SERVICES-SNAP_RIGHT
    {.port = 2,
     .channel = 0,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_MENU,
     .holdHandler = BUTTONHANDLER_LOCK}, // MENU-LOCK

    {.port = 3,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_WPM,
     .holdHandler = BUTTONHANDLER_KEYER}, // WPM-KEYER
    {.port = 3,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_DOUBLE,
     .holdHandler = BUTTONHANDLER_DOUBLEMODE}, // DOUBLE-&+
    {.port = 3,
     .channel = 5,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_FAST,
     .holdHandler = BUTTONHANDLER_STEP}, // FAST-FASTSETT
    {.port = 3,
     .channel = 4,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_BAND_N,
     .holdHandler = BUTTONHANDLER_BAND_N}, // BAND-
    {.port = 3,
     .channel = 3,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_BAND_P,
     .holdHandler = BUTTONHANDLER_BAND_P}, // BAND+
    {.port = 3,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_MODE_P,
     .holdHandler = BUTTONHANDLER_MODE_P}, // MODE+
    {.port = 3,
     .channel = 1,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_MODE_N,
     .holdHandler = BUTTONHANDLER_MODE_N}, // MODE-
    {.port = 3,
     .channel = 0,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 0,
     .tres_max = MCP3008_SINGLE_THRESHOLD,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_AsB,
     .holdHandler = BUTTONHANDLER_BANDMAP}, // A/B-BANDMAP
};

const PERIPH_FrontPanel_FuncButton PERIPH_FrontPanel_FuncButtonsList[FUNCBUTTONS_COUNT] = {};
#endif

