witalis3/UA3REO-DDC-Transceiver/STM32/WOLF/Src/front_unit.c
#ifdef FRONTPANEL_BIG_V1
PERIPH_FrontPanel_Button PERIPH_FrontPanel_Buttons[] = {
    // buttons
    {.port = 1, .channel = 0, .type = FUNIT_CTRL_AF_GAIN},    // AF GAIN
    {.port = 1, .channel = 1, .type = FUNIT_CTRL_IF_RIT_XIT}, // RIT/XIT

    {.port = 1, .channel = 2, .type = FUNIT_CTRL_TANGENT}, // TANGENT_SW1
    {.port = 1, .channel = 3, .type = FUNIT_CTRL_TANGENT}, // TANGENT_SW2

    {.port = 1,
     .channel = 4,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 450,
     .tres_max = 650,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = FRONTPANEL_ENC2SW_click_handler,
     .holdHandler = FRONTPANEL_ENC2SW_hold_handler}, // ENC2_SW
    {.port = 1,
     .channel = 4,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 250,
     .tres_max = 450,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 7,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // FUNC8
    {.port = 1,
     .channel = 4,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 000,
     .tres_max = 250,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 6,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // FUNC7
    {.port = 1,
     .channel = 5,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 450,
     .tres_max = 650,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_BAND_P,
     .holdHandler = BUTTONHANDLER_BAND_N}, // ENC_B_3
    {.port = 1,
     .channel = 5,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 250,
     .tres_max = 450,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_MODE_N,
     .holdHandler = BUTTONHANDLER_MODE_P}, // ENC_B_2
    {.port = 1,
     .channel = 5,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 000,
     .tres_max = 250,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_AsB,
     .holdHandler = BUTTONHANDLER_ArB}, // ENC_B_1
    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 450,
     .tres_max = 650,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 3,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // FUNC4
    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 250,
     .tres_max = 450,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 5,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // FUNC6
    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 000,
     .tres_max = 250,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 4,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // FUNC5
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 450,
     .tres_max = 650,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 2,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // FUNC3
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 250,
     .tres_max = 450,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 1,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // FUNC2
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 000,
     .tres_max = 250,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // FUNC1
};

const PERIPH_FrontPanel_FuncButton PERIPH_FrontPanel_FuncButtonsList[FUNCBUTTONS_COUNT] = {
    {.name = "A / B", .work_in_menu = false, .clickHandler = BUTTONHANDLER_AsB, .holdHandler = BUTTONHANDLER_AsB, .checkBool = NULL},
    {.name = "B=A", .work_in_menu = false, .clickHandler = BUTTONHANDLER_ArB, .holdHandler = BUTTONHANDLER_ArB, .checkBool = NULL},
    {.name = "TUNE", .work_in_menu = true, .clickHandler = BUTTONHANDLER_TUNE, .holdHandler = BUTTONHANDLER_TUNE, .checkBool = (uint32_t *)&TRX_Tune},
    {.name = "POWER", .work_in_menu = true, .clickHandler = BUTTONHANDLER_RF_POWER, .holdHandler = BUTTONHANDLER_RF_POWER, .checkBool = NULL},
    {.name = "XIT", .work_in_menu = false, .clickHandler = BUTTONHANDLER_XIT, .holdHandler = BUTTONHANDLER_XIT, .checkBool = (uint32_t *)&TRX.XIT_Enabled},
    {.name = "RIT", .work_in_menu = false, .clickHandler = BUTTONHANDLER_RIT, .holdHandler = BUTTONHANDLER_RIT, .checkBool = (uint32_t *)&TRX.RIT_Enabled},
    {.name = "SERVICE", .work_in_menu = true, .clickHandler = BUTTONHANDLER_SERVICES, .holdHandler = BUTTONHANDLER_SCREENSHOT, .checkBool = NULL},
    {.name = "MENU", .work_in_menu = true, .clickHandler = BUTTONHANDLER_MENU, .holdHandler = BUTTONHANDLER_MENU, .checkBool = NULL},

    {.name = "SNAP <", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SNAP_LEFT, .holdHandler = BUTTONHANDLER_AUTO_SNAP, .checkBool = (uint32_t *)&TRX.Auto_Snap},
    {.name = "SNAP >", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SNAP_RIGHT, .holdHandler = BUTTONHANDLER_AUTO_SNAP, .checkBool = (uint32_t *)&TRX.Auto_Snap},
    {.name = "DOUBLE", .work_in_menu = false, .clickHandler = BUTTONHANDLER_DOUBLE, .holdHandler = BUTTONHANDLER_DOUBLEMODE, .checkBool = (uint32_t *)&TRX.Dual_RX},
    {.name = "SPLIT", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SPLIT, .holdHandler = BUTTONHANDLER_SPLIT, .checkBool = (uint32_t *)&TRX.SPLIT_Enabled},
    {.name = "SCAN", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SCAN, .holdHandler = BUTTONHANDLER_SCAN, .checkBool = (uint32_t *)&TRX_ScanMode},
    {.name = "CQ", .work_in_menu = false, .clickHandler = BUTTONHANDLER_CQ, .holdHandler = BUTTONHANDLER_FILEMANAGER, .checkBool = (uint32_t *)&SD_PlayInProcess},
    {.name = "REC", .work_in_menu = false, .clickHandler = BUTTONHANDLER_REC, .holdHandler = BUTTONHANDLER_REC, .checkBool = (uint32_t *)&SD_RecordInProcess},
    {.name = "MENU", .work_in_menu = true, .clickHandler = BUTTONHANDLER_MENU, .holdHandler = BUTTONHANDLER_MENU, .checkBool = NULL},

    {.name = "HPF", .work_in_menu = true, .clickHandler = BUTTONHANDLER_HPF, .holdHandler = BUTTONHANDLER_HPF, .checkBool = NULL},
    {.name = "MODE-", .work_in_menu = false, .clickHandler = BUTTONHANDLER_MODE_N, .holdHandler = BUTTONHANDLER_MODE_N, .checkBool = NULL},
    {.name = "MODE+", .work_in_menu = false, .clickHandler = BUTTONHANDLER_MODE_P, .holdHandler = BUTTONHANDLER_MODE_P, .checkBool = NULL},
    {.name = "BAND-", .work_in_menu = false, .clickHandler = BUTTONHANDLER_BAND_N, .holdHandler = BUTTONHANDLER_BAND_N, .checkBool = NULL},
    {.name = "BAND+", .work_in_menu = false, .clickHandler = BUTTONHANDLER_BAND_P, .holdHandler = BUTTONHANDLER_BAND_P, .checkBool = NULL},
    {.name = "BANDMP", .work_in_menu = false, .clickHandler = BUTTONHANDLER_BANDMAP, .holdHandler = BUTTONHANDLER_BANDMAP, .checkBool = (uint32_t *)&TRX.BandMapEnabled},
    {.name = "AUTOGN", .work_in_menu = false, .clickHandler = BUTTONHANDLER_AUTOGAINER, .holdHandler = BUTTONHANDLER_AUTOGAINER, .checkBool = (uint32_t *)&TRX.AutoGain},
    {.name = "MENU", .work_in_menu = true, .clickHandler = BUTTONHANDLER_MENU, .holdHandler = BUTTONHANDLER_MENU, .checkBool = NULL},

    {.name = "SAMPLE-", .work_in_menu = true, .clickHandler = BUTTONHANDLER_SAMPLE_N, .holdHandler = BUTTONHANDLER_SAMPLE_N, .checkBool = NULL},
    {.name = "SAMPLE+", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SAMPLE_P, .holdHandler = BUTTONHANDLER_SAMPLE_P, .checkBool = NULL},
    {.name = "ZOOM-", .work_in_menu = false, .clickHandler = BUTTONHANDLER_ZOOM_N, .holdHandler = BUTTONHANDLER_ZOOM_N, .checkBool = NULL},
    {.name = "ZOOM+", .work_in_menu = false, .clickHandler = BUTTONHANDLER_ZOOM_P, .holdHandler = BUTTONHANDLER_ZOOM_P, .checkBool = NULL},
    {.name = "SQL", .work_in_menu = true, .clickHandler = BUTTONHANDLER_SQUELCH, .holdHandler = BUTTONHANDLER_SQUELCH, .checkBool = (uint32_t *)&TRX.SQL_shadow},
    {.name = "WPM", .work_in_menu = true, .clickHandler = BUTTONHANDLER_WPM, .holdHandler = BUTTONHANDLER_WPM, .checkBool = NULL},
    {.name = "LOCK", .work_in_menu = true, .clickHandler = BUTTONHANDLER_LOCK, .holdHandler = BUTTONHANDLER_LOCK, .checkBool = (uint32_t *)&TRX.Locked},
    {.name = "MENU", .work_in_menu = true, .clickHandler = BUTTONHANDLER_MENU, .holdHandler = BUTTONHANDLER_MENU, .checkBool = NULL},

    {.name = "MACRO1", .work_in_menu = false, .clickHandler = BUTTONHANDLER_CW_MACROS, .holdHandler = BUTTONHANDLER_CW_MACROS, .parameter = 1},
    {.name = "MACRO2", .work_in_menu = false, .clickHandler = BUTTONHANDLER_CW_MACROS, .holdHandler = BUTTONHANDLER_CW_MACROS, .parameter = 2},
    {.name = "MACRO3", .work_in_menu = false, .clickHandler = BUTTONHANDLER_CW_MACROS, .holdHandler = BUTTONHANDLER_CW_MACROS, .parameter = 3},
    {.name = "MACRO4", .work_in_menu = false, .clickHandler = BUTTONHANDLER_CW_MACROS, .holdHandler = BUTTONHANDLER_CW_MACROS, .parameter = 4},
    {.name = "MACRO5", .work_in_menu = false, .clickHandler = BUTTONHANDLER_CW_MACROS, .holdHandler = BUTTONHANDLER_CW_MACROS, .parameter = 5},
    {.name = "CESSB", .work_in_menu = false, .clickHandler = BUTTONHANDLER_CESSB, .holdHandler = BUTTONHANDLER_CESSB, .checkBool = (uint32_t *)&TRX.TX_CESSB},
    {.name = "VOX", .work_in_menu = true, .clickHandler = BUTTONHANDLER_VOX, .holdHandler = BUTTONHANDLER_VOX, .checkBool = (uint32_t *)&TRX.VOX},
    {.name = "FILES", .work_in_menu = false, .clickHandler = BUTTONHANDLER_FILEMANAGER, .holdHandler = BUTTONHANDLER_FILEMANAGER, .checkBool = NULL},

    // hidden entry for menu editor
    {.name = "FT8", .work_in_menu = false, .clickHandler = BUTTONHANDLER_FT8, .holdHandler = BUTTONHANDLER_FT8, .checkBool = NULL},
    {.name = "ANT", .work_in_menu = false, .clickHandler = BUTTONHANDLER_ANT, .holdHandler = BUTTONHANDLER_ANT, .checkBool = NULL},
};
#endif

#ifdef FRONTPANEL_WF_100D
PERIPH_FrontPanel_Button PERIPH_FrontPanel_Buttons[] = {
    // buttons
    {.port = 1, .channel = 0, .type = FUNIT_CTRL_AF_GAIN},    // AF GAIN
    {.port = 1, .channel = 1, .type = FUNIT_CTRL_IF_RIT_XIT}, // RIT/XIT

    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 100,
     .tres_max = 231,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 8,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // SB16 F9
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 231,
     .tres_max = 354,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 7,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // SB17 F8
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 354,
     .tres_max = 492,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 6,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // SB18 F7
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 492,
     .tres_max = 700,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 5,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // SB19 F6

    {.port = 1,
     .channel = 3,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 117,
     .tres_max = 231,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 4,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // SB23 F5
    {.port = 1,
     .channel = 3,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 231,
     .tres_max = 354,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 3,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // SB24 F4
    {.port = 1,
     .channel = 3,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 354,
     .tres_max = 492,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 2,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // SB20 F3
    {.port = 1,
     .channel = 3,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 492,
     .tres_max = 700,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 1,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // SB21 F2

    {.port = 1,
     .channel = 4,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 117,
     .tres_max = 231,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_MENU,
     .holdHandler = BUTTONHANDLER_MENUHOLD}, // SB22 MENU
    {.port = 1,
     .channel = 4,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 231,
     .tres_max = 354,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_TUNE,
     .holdHandler = BUTTONHANDLER_TUNE}, // SB13 TUNE ATU
    {.port = 1,
     .channel = 4,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 354,
     .tres_max = 492,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_MUTE,
     .holdHandler = BUTTONHANDLER_MUTE_AFAMP}, // SB14 MUTE
    {.port = 1,
     .channel = 4,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 492,
     .tres_max = 700,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH}, // SB15 F1

    {.port = 1,
     .channel = 5,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 117,
     .tres_max = 231,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_10m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB2 10M
    {.port = 1,
     .channel = 5,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 231,
     .tres_max = 354,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_CB,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB3 CB
    {.port = 1,
     .channel = 5,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 354,
     .tres_max = 492,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_2m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB4 2M
    {.port = 1,
     .channel = 5,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 492,
     .tres_max = 700,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_FM,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB5 FM

    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 117,
     .tres_max = 231,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_20m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB6 20M
    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 231,
     .tres_max = 354,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_17m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB7 17M
    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 354,
     .tres_max = 492,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_15m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB11 15M
    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 492,
     .tres_max = 700,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_12m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB12 12M

    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 117,
     .tres_max = 231,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_160m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB8 160M
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 231,
     .tres_max = 354,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_80m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB9 80M
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 354,
     .tres_max = 492,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_40m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB10 40M
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 492,
     .tres_max = 650,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_30m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB1 30M
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 650,
     .tres_max = 750,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = FRONTPANEL_ENC2SW_click_handler,
     .holdHandler = FRONTPANEL_ENC2SW_hold_handler}, // ENC2_SW
};

const PERIPH_FrontPanel_FuncButton PERIPH_FrontPanel_FuncButtonsList[FUNCBUTTONS_COUNT] = {
    {.name = "A / B", .work_in_menu = false, .clickHandler = BUTTONHANDLER_AsB, .holdHandler = BUTTONHANDLER_AsB, .checkBool = NULL},
    {.name = "B=A", .work_in_menu = false, .clickHandler = BUTTONHANDLER_ArB, .holdHandler = BUTTONHANDLER_ArB, .checkBool = NULL},
    {.name = "POWER", .work_in_menu = true, .clickHandler = BUTTONHANDLER_RF_POWER, .holdHandler = BUTTONHANDLER_RF_POWER, .checkBool = NULL},
    {.name = "DOUBLE", .work_in_menu = false, .clickHandler = BUTTONHANDLER_DOUBLE, .holdHandler = BUTTONHANDLER_DOUBLEMODE, .checkBool = (uint32_t *)&TRX.Dual_RX},
    {.name = "XIT", .work_in_menu = true, .clickHandler = BUTTONHANDLER_XIT, .holdHandler = BUTTONHANDLER_XIT, .checkBool = (uint32_t *)&TRX.XIT_Enabled},
    {.name = "RIT", .work_in_menu = false, .clickHandler = BUTTONHANDLER_RIT, .holdHandler = BUTTONHANDLER_RIT, .checkBool = (uint32_t *)&TRX.RIT_Enabled},
    {.name = "CQ", .work_in_menu = false, .clickHandler = BUTTONHANDLER_CQ, .holdHandler = BUTTONHANDLER_FILEMANAGER, .checkBool = (uint32_t *)&SD_PlayInProcess},
    {.name = "REC", .work_in_menu = false, .clickHandler = BUTTONHANDLER_REC, .holdHandler = BUTTONHANDLER_REC, .checkBool = (uint32_t *)&SD_RecordInProcess},
    {.name = "SERVICE", .work_in_menu = true, .clickHandler = BUTTONHANDLER_SERVICES, .holdHandler = BUTTONHANDLER_SCREENSHOT, .checkBool = NULL},

    {.name = "SAMPL-", .work_in_menu = true, .clickHandler = BUTTONHANDLER_SAMPLE_N, .holdHandler = BUTTONHANDLER_SAMPLE_N, .checkBool = NULL},
    {.name = "SAMPL+", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SAMPLE_P, .holdHandler = BUTTONHANDLER_SAMPLE_P, .checkBool = NULL},
    {.name = "ZOOM-", .work_in_menu = false, .clickHandler = BUTTONHANDLER_ZOOM_N, .holdHandler = BUTTONHANDLER_ZOOM_N, .checkBool = NULL},
    {.name = "ZOOM+", .work_in_menu = false, .clickHandler = BUTTONHANDLER_ZOOM_P, .holdHandler = BUTTONHANDLER_ZOOM_P, .checkBool = NULL},
    {.name = "SNAP <", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SNAP_LEFT, .holdHandler = BUTTONHANDLER_AUTO_SNAP, .checkBool = (uint32_t *)&TRX.Auto_Snap},
    {.name = "SNAP >", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SNAP_RIGHT, .holdHandler = BUTTONHANDLER_AUTO_SNAP, .checkBool = (uint32_t *)&TRX.Auto_Snap},
    {.name = "SPLIT", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SPLIT, .holdHandler = BUTTONHANDLER_SPLIT, .checkBool = (uint32_t *)&TRX.SPLIT_Enabled},
    {.name = "WPM", .work_in_menu = true, .clickHandler = BUTTONHANDLER_WPM, .holdHandler = BUTTONHANDLER_WPM, .checkBool = NULL},
    //{.name = "DPD", .work_in_menu = true, .clickHandler = BUTTONHANDLER_DPD, .holdHandler = BUTTONHANDLER_DPD_CALIBRATE, .checkBool = (uint32_t *)&TRX.Digital_Pre_Distortion},
    {.name = "TUNE", .work_in_menu = true, .clickHandler = BUTTONHANDLER_TUNE, .holdHandler = BUTTONHANDLER_TUNE, .checkBool = (uint32_t *)&TRX_Tune},

    {.name = "SCAN", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SCAN, .holdHandler = BUTTONHANDLER_SCAN, .checkBool = (uint32_t *)&TRX_ScanMode},
    {.name = "HPF", .work_in_menu = true, .clickHandler = BUTTONHANDLER_HPF, .holdHandler = BUTTONHANDLER_HPF, .checkBool = NULL},
    {.name = "MODE+", .work_in_menu = false, .clickHandler = BUTTONHANDLER_MODE_P, .holdHandler = BUTTONHANDLER_MODE_P, .checkBool = NULL},
    {.name = "MODE-", .work_in_menu = false, .clickHandler = BUTTONHANDLER_MODE_N, .holdHandler = BUTTONHANDLER_MODE_N, .checkBool = NULL},
    {.name = "BAND-", .work_in_menu = false, .clickHandler = BUTTONHANDLER_BAND_N, .holdHandler = BUTTONHANDLER_BAND_N, .checkBool = NULL},
    {.name = "BAND+", .work_in_menu = false, .clickHandler = BUTTONHANDLER_BAND_P, .holdHandler = BUTTONHANDLER_BAND_P, .checkBool = NULL},
    {.name = "BANDMP", .work_in_menu = false, .clickHandler = BUTTONHANDLER_BANDMAP, .holdHandler = BUTTONHANDLER_BANDMAP, .checkBool = (uint32_t *)&TRX.BandMapEnabled},
    {.name = "AUTOGN", .work_in_menu = false, .clickHandler = BUTTONHANDLER_AUTOGAINER, .holdHandler = BUTTONHANDLER_AUTOGAINER, .checkBool = (uint32_t *)&TRX.AutoGain},
    {.name = "LOCK", .work_in_menu = true, .clickHandler = BUTTONHANDLER_LOCK, .holdHandler = BUTTONHANDLER_LOCK, .checkBool = (uint32_t *)&TRX.Locked},

